Register and login proof are ok
